// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// Variables

// Input
Console.WriteLine("Please, input array length: ");
int input_array_length = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Please, input array length: ");
int input_array_length = Convert.ToInt32(Console.ReadLine());
// Methods

// Body
